experimentacion_ab/resultados/redis_baseline_bench.txt
====== BF.ADD bloom_bench __rand_int__ ======
  1000000 requests completed in 0.89 seconds
  50 parallel clients
  53 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.247 milliseconds (cumulative count 50)
50.000% <= 1.991 milliseconds (cumulative count 512900)
75.000% <= 2.143 milliseconds (cumulative count 751300)
87.500% <= 2.343 milliseconds (cumulative count 878000)
93.750% <= 2.639 milliseconds (cumulative count 938100)
96.875% <= 3.215 milliseconds (cumulative count 968800)
98.438% <= 3.895 milliseconds (cumulative count 984550)
99.219% <= 4.071 milliseconds (cumulative count 992200)
99.609% <= 4.183 milliseconds (cumulative count 996100)
99.805% <= 4.351 milliseconds (cumulative count 998050)
99.902% <= 4.431 milliseconds (cumulative count 999050)
99.951% <= 4.511 milliseconds (cumulative count 999550)
99.976% <= 4.551 milliseconds (cumulative count 999800)
99.988% <= 4.575 milliseconds (cumulative count 999900)
99.994% <= 4.583 milliseconds (cumulative count 999950)
99.997% <= 4.607 milliseconds (cumulative count 1000000)
100.000% <= 4.607 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.020% <= 0.303 milliseconds (cumulative count 200)
0.025% <= 0.407 milliseconds (cumulative count 250)
0.035% <= 0.503 milliseconds (cumulative count 350)
0.055% <= 0.703 milliseconds (cumulative count 550)
0.100% <= 0.807 milliseconds (cumulative count 1000)
0.160% <= 0.903 milliseconds (cumulative count 1600)
0.190% <= 1.007 milliseconds (cumulative count 1900)
0.200% <= 1.103 milliseconds (cumulative count 2000)
0.205% <= 1.207 milliseconds (cumulative count 2050)
0.270% <= 1.407 milliseconds (cumulative count 2700)
0.720% <= 1.503 milliseconds (cumulative count 7200)
2.120% <= 1.607 milliseconds (cumulative count 21200)
4.800% <= 1.703 milliseconds (cumulative count 48000)
13.395% <= 1.807 milliseconds (cumulative count 133950)
30.740% <= 1.903 milliseconds (cumulative count 307400)
54.885% <= 2.007 milliseconds (cumulative count 548850)
70.880% <= 2.103 milliseconds (cumulative count 708800)
96.570% <= 3.103 milliseconds (cumulative count 965700)
99.345% <= 4.103 milliseconds (cumulative count 993450)
100.000% <= 5.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 1121076.25 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        2.080     0.240     1.991     2.783     4.031     4.607