experimentacion_ab/resultados/redis_modificado_bench.txt
====== MF.ADD mod_bench __rand_int__ ======
  1000000 requests completed in 0.51 seconds
  50 parallel clients
  50 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.223 milliseconds (cumulative count 50)
50.000% <= 1.103 milliseconds (cumulative count 518100)
75.000% <= 1.199 milliseconds (cumulative count 764150)
87.500% <= 1.287 milliseconds (cumulative count 876350)
93.750% <= 1.439 milliseconds (cumulative count 937900)
96.875% <= 1.799 milliseconds (cumulative count 968800)
98.438% <= 1.975 milliseconds (cumulative count 984550)
99.219% <= 2.119 milliseconds (cumulative count 992450)
99.609% <= 2.287 milliseconds (cumulative count 996150)
99.805% <= 5.463 milliseconds (cumulative count 998050)
99.902% <= 5.671 milliseconds (cumulative count 999050)
99.951% <= 5.799 milliseconds (cumulative count 999600)
99.976% <= 5.831 milliseconds (cumulative count 999800)
99.988% <= 5.863 milliseconds (cumulative count 999900)
99.994% <= 5.871 milliseconds (cumulative count 999950)
99.997% <= 5.887 milliseconds (cumulative count 1000000)
100.000% <= 5.887 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.020% <= 0.303 milliseconds (cumulative count 200)
0.120% <= 0.407 milliseconds (cumulative count 1200)
0.255% <= 0.503 milliseconds (cumulative count 2550)
0.525% <= 0.607 milliseconds (cumulative count 5250)
1.035% <= 0.703 milliseconds (cumulative count 10350)
1.915% <= 0.807 milliseconds (cumulative count 19150)
5.480% <= 0.903 milliseconds (cumulative count 54800)
23.105% <= 1.007 milliseconds (cumulative count 231050)
51.810% <= 1.103 milliseconds (cumulative count 518100)
77.880% <= 1.207 milliseconds (cumulative count 778800)
88.805% <= 1.303 milliseconds (cumulative count 888050)
93.135% <= 1.407 milliseconds (cumulative count 931350)
94.625% <= 1.503 milliseconds (cumulative count 946250)
95.485% <= 1.607 milliseconds (cumulative count 954850)
96.140% <= 1.703 milliseconds (cumulative count 961400)
96.935% <= 1.807 milliseconds (cumulative count 969350)
97.855% <= 1.903 milliseconds (cumulative count 978550)
98.675% <= 2.007 milliseconds (cumulative count 986750)
99.160% <= 2.103 milliseconds (cumulative count 991600)
99.750% <= 3.103 milliseconds (cumulative count 997500)
100.000% <= 6.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 1956947.25 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        1.142     0.216     1.103     1.551     2.071     5.887